app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$4TTP2s4KaLY6aEogabk0SOB/BtbEvc2wgywrN/yuEmQ74.qvWJPjC"], ["updated_at", "2016-10-17 21:30:03.373367"], ["id", 2]]
---
	def update
		@user=User.find(params[:id])
		if @user.update_attributes(user_params)

SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "users"
---
    def index
    @users = User.paginate(page: params[:page], :per_page => 5)